     H*******************************************************************                           
     H*                                                                 *                           
     H*   システム名      :ＣＳ．ｃｈ                             *                           
     H*   サブシステム名  :教育                                   *                           
     H*   プログラム名    :基礎１）品目マスタ一覧／品目コード順   *                           
     H*   プログラムＩＤ  : CH03001R                                *                           
     H*   会　社　名　　  :㈱中部システム                         *                           
     H*                                                                 *                           
     H*     作　成　者    :㈱中部システム　牛田　吉樹             *                           
     H*     作　成　日    : 2024/06/20                              *                           
     H*                                                                 *                           
     H*     変　更　者    :                                         *                           
     H*     変　更　日    : ____/__/__                              *                           
     H*                                                                 *                           
     H*  プログラム概要                                               *                           
     H*                                                               *                           
     H*                                                               *                           
     H*                                                                 *                           
     H*******************************************************************                           
     H******************************************************************                           
     H*Ｈ仕様書（プログラム固有定義）                               **                           
     H******************************************************************                           
     H*■日付形式…ジョブ日付　ＵＤＡＴＥ（ＹＹ／ＭＭ／ＤＤ）                                    
     H DATEDIT(*YMD)                                                                                
     H COPYRIGHT('COPYRIGHT(C) CHUBU SYSTEM CO.,LTD. +                                              
     H                                          ALL RIGHTS RESERVED')                               
     H*■コンパイルオプション                                                                    
     H DFTACTGRP(*NO) ACTGRP(*NEW)                                                                  
     F******************************************************************                           
     F*Ｆ仕様書（ファイル定義）                                     **                           
     F******************************************************************                           
     F*-----<<ファイル定義>>-----*                                                                
     F*■宣言                                                                                    
     F* 　Ｉ…入力専用／Ｏ…出力専用／Ｕ…入力＆出力（ＤＢ）／Ｃ…入力＆出力（画面）             
     F* 　Ｆ…全手順（自己でデータベースの読取り処理を記述する方式                               
     F* 　Ａ…データベースレコードの追加をする場合                                               
     F* 　Ｅ…外部記述（ＤＤＳで定義されたデータベース                                           
     F* 　Ｋ…外部記述で定義されたキーを使用（※キーなしＤＢは物理順                             
     F* 　ＤＩＳＫ…データベース／ＰＲＩＮＴＥＲ…印刷装置／ＷＯＲＫＳＴＮ…画面装置             
     F*                                                                                             
     F*■ファイルオープンについて...                                                             
     F* 　一般的にプログラムはレコードを読み取るにはファイルはオープンする必要があるが           
     F* 　本サンプルでは”暗黙的にオープン”されるため、ＯＰＥＮ命令を使用する必要がない         
     F*                                                                                             
     F*■オプション                                                                              
     F* 　ＯＦＬＩＮＤ…オーバーフロー行数を出力すると”ＯＮ”になる標識                         
     F*                                                                                             
     F*■標識（＊ＩＮｘｘ）とは...                                                               
     F* 　プログラムで用意されている変数。０１～９９番までの１Ａ（１Ｎ）の配列                   
     F* 　”０（初期値）”…ＯＦＦ／”１”…ＯＮ                                                 
     F*品目マスタ                                                                                 
     FMSHINAF   IF   E           K DISK                                                             
     F*品目マスタ一覧                                                                             
     FCH03001P  O    E             PRINTER OFLIND(*IN80)                                            
     D******************************************************************                           
     D*Ｄ仕様書（変数定義）                                         **                           
     D******************************************************************                           
     D*====================================                                                         
     D*ＳＤＳ…システム情報                                                                      
     D*====================================                                                         
     D SYS@INFO       SDS                                                                           
     D  SYS@PROC         *PROC                                                                      
     D  SYS@PGM_STS      *STATUS                                                状況コード        
     D  SYS@LINE_NUM          21     28                                         ソース行番号      
     D  SYS@PARMS        *PARMS                                                                     
     D  SYS@PGM                1     10A                                        プログラムＩＤ    
     D  SYS@EXCP_TYPE         40     42                                         例外タイプ        
     D  SYS@EXCP_NUM          43     46                                         例外番号          
     D  SYS@PGM_LIB           81     90                                         ＰＧＭライブラリー
     D  SYS@EXCP_DATA         91    170                                         例外データ        
     D  SYS@WSID             244    253A                                        端末ORジョブ    
     D  SYS@JUSR             254    263A                                        ジョブユーザーＩＤ
     D  SYS@JOBNO            264    269S 0                                      ジョブ№          
     D  SYS@USER             358    367A                                        現行ユーザーＩＤ  
     D*====================================                                                         
     D*ユーザー定義                                                                              
     D*====================================                                                         
     D*-----<<テーブル定義>>-----*                                                                
     D*-----<<変数定義>>-----*                                                                    
     C******************************************************************                           
     C*Ｃ仕様書（演算処理）                                         **                           
     C******************************************************************                           
     C******************************************************************                           
     C** ＰＬＩＳＴ（プログラムが受渡する引数の定義）               **                           
     C******************************************************************                           
     C*========================================                                                     
     C* 変数の型＆桁宣言                                                                         
     C*========================================                                                     
     C* 引数定義）                                                                               
     C*　＊ＥＮＴＲＹ…プログラムの入出力引数（パラメータ）の予約語                              
     C*　　ＰＬＩＳＴ…引数リストを表す                                                          
     C*　　ＰＡＲＭ　…引数定義                                                                  
     C*                                                                                             
     C* 変数の型桁定義　方法１）結果フィールドの右側に記述する                                   
     C**     *ENTRY        PLIST                                                                    
     C**                   PARM                    P@NAHNCDS         5 0          品目コード（開始
     C**                   PARM                    P@NAHNCDE         5 0          品目コード（終了
     C*                                                                                             
     C* 変数の型桁定義　方法２）＊ＬＩＫＥ／ＤＥＦＩＮＥで別の変数と同様の定義とする             
     C*　＊ＬＩＫＥ～ＤＥＦＩＮＥ…指定変数と同様の定義                                          
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    P@NAHNCDS                      品目コード（開始  
     C                   PARM                    P@NAHNCDE                      品目コード（終了  
     C     *LIKE         DEFINE    MHNAHNCD      P@NAHNCDS                                          
     C     *LIKE         DEFINE    MHNAHNCD      P@NAHNCDE                                          
     C*                                                                                             
     C******************************************************************                           
     C** ＫＬＩＳＴ（データベースで使用するキーの定義）             **                           
     C******************************************************************                           
     C*                                                                                             
     C* キー定義）                                                                               
     C*　　ＫＬＩＳＴ…キーリストを表す                                                          
     C*　　ＫＦＬＤ　…キー定義                                                                  
     C*                                                                                             
     C* 品目マスタ                                                                               
     C     MHNAKEY1      KLIST                                                                      
     C                   KFLD                    K@NAHNCD                       品目コード        
     C     *LIKE         DEFINE    MHNAHNCD      K@NAHNCD                                           
     C*-****************************************************************                           
     C*-*基本ロジック（メインロジック）                             **                           
     C*-****************************************************************                           
     C*                                                                                             
     C*初期処理                                                                                  
     C* サブルーチン（定形、共通処理をまとめたモノ）の呼び出し                                   
     C*　　ＥＸＳＲ…サブルーチンの呼び出し                                                      
     C                   EXSR      @INZ                                                             
     C*読取処理                                                                                  
     C                   EXSR      @RED1                                                            
     C*                                                                                             
     C* タグ                                                                                     
     C*　　ＴＡＧ…プログラムにとって付箋のようなモノ                                            
     C*　　　　　　ＧＯＴＯ命令のジャンプ先                                                      
     C     #MA01         TAG                                                                        
     C*                                                                                             
     C*ＥＯＦになるまで繰り返し処理                                                              
     C* 条件分岐                                                                                 
     C*　　ＩＦ…条件が真のとき〇〇する                                                          
     C                   IF        *IN90       = *ON                                                
     C                   GOTO      #MA09                                                            
     C                   ENDIF                                                                      
     C*                                                                                             
     C*  ヘッダー部出力                                                                          
     C   80              EXSR      @HEAD1                                                           
     C*                                                                                             
     C*  明細部出力                                                                              
     C                   EXSR      @ITEM1                                                           
     C*                                                                                             
     C*読取処理                                                                                  
     C                   EXSR      @RED1                                                            
     C*                                                                                             
     C* ジャンプ                                                                                 
     C*　　ＧＯＴＯ…指定タグへジャンプ                                                          
     C                   GOTO      #MA01                                                            
     C*                                                                                             
     C     #MA09         TAG                                                                        
     C*                                                                                             
     C                   EXSR      @END                                                             
     C*-****************************************************************                           
     C*-* @INZ         初期処理                                     **                           
     C*-****************************************************************                           
     C* サブルーチン（共通処理をまとめたモノ）の定義                                             
     C*　　ＢＥＧＳＲ…サブルーチン定義の開始                                                    
     C*　　ＥＮＤＳＲ…サブルーチン定義の終了                                                    
     C     @INZ          BEGSR                                                                      
     C*                                                                                             
     C*システム日付設定                                                                          
     C* システム日付／時刻                                                                       
     C*　　ＴＩＭＥ…システム時刻／日付（ＨＨＭＭＳＳＹＹＹＹＭＭＤＤ）を取得                    
     C                   TIME                    WTIME            14 0                              
     C* 転送                                                                                     
     C*　　ＭＯＶＥ　…右詰めで転送                                                              
     C*　　ＭＯＶＥＬ…左詰めで転送                                                              
     C                   MOVE      WTIME         WDATE8            8 0          システム日付      
     C                   MOVEL     WTIME         WTIME6            6 0          システム時間      
     C*                                                                                             
     C*オーバーフロー標識ＯＮ（初回用）                                                          
     C* 標識のオン／オフ                                                                         
     C*　　ＳＥＴＯＮ　…標識をオンにする（＊ＯＮ　｜’１’）                                    
     C*　　ＳＥＴＯＦＦ…標識をオンにする（＊ＯＦＦ｜’０’）                                    
     C                   SETON                                        80                            
     C*                                                                                             
     C*データベース・開始キーの位置づけ                                                          
     C* キーの位置づけ（レコード読み取り開始位置の設定）                                         
     C*　　ＳＥＴＬＬ　…指定キー下限にカーソルを位置づけ                                        
     C                   Z-ADD     P@NAHNCDS     K@NAHNCD                       品目コード        
     C     MHNAKEY1      SETLL     MSHINAR                                                          
     C*                                                                                             
     C                   ENDSR                                                                      
     C*-****************************************************************                           
     C*-* @RED1        読取処理                                     **                           
     C*-****************************************************************                           
     C     @RED1         BEGSR                                                                      
     C*                                                                                             
     C     #RED11        TAG                                                                        
     C*                                                                                             
     C* データベース・レコードの読み取り                                                         
     C*　　ＲＥＡＤ…現在のカーソル位置から１件のレコードを順に読み取る                          
     C                   READ      MSHINAR                                90                        
     C*                                                                                             
     C* 終了判定                                                                                 
     C*　　＊ＩＮ９０＝ＯＮ　…レコードが読み取れなかった／ＥＯＦ（Ｅｎｄ　Ｏｆ　Ｆｉｌｅ）      
     C*　　＊ＩＮ９０＝ＯＦＦ…レコードが読み取れた                                              
     C*　　ＬＥＡＶＥＳＲ　　…サブルーチンの終了                                                
     C*ＥＯＦ…サブルーチンを抜ける                                                              
     C   90              LEAVESR                                                                    
     C*                                                                                             
     C*終了条件を超えた                                                                          
     C                   IF        P@NAHNCDE   > *ZERO          AND                                 
     C                             MHNAHNCD    > P@NAHNCDE                                          
     C                   SETON                                        90                            
     C                   LEAVESR                                                                    
     C                   ENDIF                                                                      
     C*                                                                                             
     C                   ENDSR                                                                      
     C*-****************************************************************                           
     C*-* @HEAD1       ヘッダー出力                                 **                           
     C*-****************************************************************                           
     C     @HEAD1        BEGSR                                                                      
     C*                                                                                             
     C*  ヘッダークリアー                                                                        
     C*  ※ＰＡＧＥを使用している場合はページもクリアされる                                      
     C* レコードを全消去（クリアー）                                                             
     C*　　ＣＬＥＡＲ…フィールド／レコードを消去                                                
     C*　　　　　　　　数値項目はゼロ、文字項目はブランクに設定される                            
     C*****                   CLEAR                   HEAD1                                         
     C*                                                                                             
     C                   MOVEL(P)  SYS@USER      H1USER                         ユーザー          
     C*                                                                                             
     C* 数値の加算                                                                               
     C*　　Ｚ－ＡＤＤ…ゼロにして加算                                                            
     C*　　ＡＤＤ　　…加算                                                                      
     C                   Z-ADD     WDATE8        H1DATE                         発行日付          
     C                   Z-ADD     WTIME6        H1TIME                         発行時間          
     C*                                                                                             
     C                   MOVEL(P)  *ALL'-'       H1KSN1                         罫線              
     C*                                                                                             
     C* 見出しレコードを出力（印字）                                                             
     C*　　ＷＲＩＴＥ…レコードを出力（改ページされる）                                          
     C                   WRITE     HEAD1                                                            
     C*                                                                                             
     C*  ヘッダーを出力したら、オーバーフロー標識をＯＦＦ                                        
     C                   SETOFF                                       80                            
     C*                                                                                             
     C                   ENDSR                                                                      
     C*-****************************************************************                           
     C*-* @ITEM1       明細出力                                     **                           
     C*-****************************************************************                           
     C     @ITEM1        BEGSR                                                                      
     C*                                                                                             
     C*  明細クリアー                                                                            
     C                   CLEAR                   ITEM1                                              
     C*                                                                                             
     C                   Z-ADD     MHNAHNCD      I1NAHNCD                       品目コード        
     C                   MOVEL(P)  MNNAHNNM      I1NAHNNM                       品目名称          
     C                   MOVEL(P)  MHNAHNKN      I1NAHNKN                       品目カナ          
     C                   Z-ADD     MHNAHNBN1     I1NAHNBN1                      品目分類（大      
     C                   Z-ADD     MHNAHNBN2     I1NAHNBN2                      品目分類（中      
     C                   Z-ADD     MHNAHNBN3     I1NAHNBN3                      品目分類（小      
     C                   Z-ADD     MHNASICD      I1NASICD                       仕入先コード（省略
     C                   MOVEL(P)  MHNAHAIS      I1NAHAIS                       廃止区分          
     C*                                                                                             
     C*  明細出力                                                                                
     C                   WRITE     ITEM1                                                            
     C*                                                                                             
     C                   ENDSR                                                                      
     C*-****************************************************************                           
     C*-* @END         終了処理                                     **                           
     C*-****************************************************************                           
     C     @END          BEGSR                                                                      
     C*                                                                                             
     C                   SETON                                        LR                            
     C                   RETURN                                                                     
     C*                                                                                             
     C                   ENDSR 
     C* TEST                                                                     