**FREE                                                                                              
DSPLY 'HELLO Everyone';
DSPLY 'I am here';                                                                                  
*INLR = *ON;                                                                                        
RETURN;                                                                                             
                                                                                                    